{
    "Information Transmission Theory" : "Théorie de la transmission de l'information",
    "Teoria Transmiterii Informației":  "Théorie de la transmission de l'information",
    "Home":"Accueil",
    "Lecture":"Cours",
    "Notes" :"Notes",
    "Application": "Laboratoire",
    "Quiz":"Quiz",
    "About":"À propos",
    "Codul Hamming ciclic corector de o eroare utilizat în codarea canalului":"Détection et correction d’erreurs à l’aide de code Hamming cyclique dans un canal de communication",
    "De ce este necesară utilizarea":"Pourquoi l'utilisation de tels codes est-elle ",
    "unor astfel de coduri în proiectarea":" nécessaire dans la conception",
    "sistemelor de comunicații digitale ?":"des systèmes de communication numérique?",
    "Pentru a transmite sau a stoca informația într-un mod fiabil, fără ca integritatea acesteia să fie coruptă în urma interacțiunii inevitabile cu anumiți factori perturbatori precum: interferențe electromagnetice, zgomot, pătări sau deteriorări în timpul printării sau scanării cum ar fi în cazul codurilor QR, congestia rețelei de comunicații, pentru a compensa erorile fizice care pot să apară în timpul citirii datelor de pe medii optice(CD-uri, DVD-uri și Blu-ray-uri). Și lista încă poate continua.":"Pour transmettre ou stocker des informations de manière fiable, sans que leur intégrité ne soit corrompue en raison de l'interaction inévitable avec certains facteurs perturbateurs tels que : les interférences électromagnétiques, le bruit, les taches ou les dommages lors de l'impression ou de la numérisation, comme dans le cas des codes QR, la congestion du réseau de communication, pour compenser les erreurs physiques qui peuvent survenir lors de la lecture de données à partir de supports optiques (CD, DVD et Blu-ray). Et la liste peut encore continuer.",
    "Cu alte cuvinte, informația pe care o transmitem ne dorim să fie aceeași la recepție, să nu conțină erori, iar în caz contrar, acestea să fie detectate și corectate pentru a ne putea bucura de informația corectă. Acest lucru este posibil prin":"En d'autres termes, nous voulons que l'information que nous transmettons soit la même à la réception, sans erreurs, et si ce n'est pas le cas, ces erreurs doivent être détectées et corrigées afin que nous puissions profiter d'une information précise. Cela est possible grâce à",
    "codarea canalului" : "le codage du canal",
    "care implică adăugarea de redundanță mesajului (informației) pentru a-l face mai rezistent la zgomot sau alți factori perturbatori, care sunt prezenți, din păcate, atât în sistemele de comunicații wireless, cât și în cele de stocare magnetică. Spre deosebire de codarea surselor (compresie), utilizată pentru a elimina redundanța din surse (de exemplu, fișierele zip și imaginile JPEG), implicit de a reduce și lățimea de bandă, codarea canalului consumă lățimea de bandă prin introducerea biților redundanți.":"qui implique l'ajout de redondance au message (à l'information) pour le rendre plus résistant au bruit ou à d'autres facteurs perturbateurs, malheureusement présents à la fois dans les systèmes de communication sans fil et dans les systèmes de stockage magnétique. Contrairement au codage source (compression) utilisé pour éliminer la redondance des sources (par exemple, les fichiers zip et les images JPEG), implicitement pour réduire la largeur de bande, le codage de canal consomme la largeur de bande en introduisant des bits redondants.",
    "Conceptele tehnice și teoremele cheie care au revoluționat înțelegerea erorilor în transmiterea de date au fost fondate de":"Les concepts techniques et les théorèmes clés qui ont révolutionné la compréhension des erreurs dans la transmission des données ont été établis par",
    "părintele teoriei informației":"Père de la théorie de l'information",
    "În cadrul lucrării sale intitulate":"Dans son travail intitulé",
    "a introdus conceptul cunoscut astăzi sub numele de a doua teoremă a lui Shannon, care oferă o soluție pentru gestionarea perturbațiilor în transmiterea și stocarea informațiilor. Enunțul teoremei statuează faptul că":"a introduit le concept connu aujourd'hui sous le nom du deuxième théorème de Shannon, qui offre une solution pour la gestion des perturbations dans la transmission et le stockage de l'information. L'énoncé du théorème stipule que",
    "pe un canal cu interferențe":" sur un canal avec des interférences",
    "având o anumită capacitate (notată C),":"ayant une certaine capacité (notée C),",
    "este posibilă realizare unei transmisii în timp real a unei surse de informație cu un debit (Ḋ) mai mic decât capacitatea canalului,cu o probabilitate extrem de mică a erorilor (P(E)), prin utilizarea unui cod cu o anumită lungime (n).":"il est possible de réaliser une transmission en temps réel d'une source d'information avec un débit (Ḋ) inférieur à la capacité du canal, avec une probabilité d'erreurs extrêmement faible (P(E)), en utilisant un code de longueur (n) particulière.",
    "A doua teoremă formulată de Claude Shannon evidențiază o observație notabilă:":"La deuxième théorème formulée par Claude Shannon met en évidence une observation notable:",
    "indiferent de nivelul de perturbare prezent într-un canal de comunicații, teoretic, există posibilitatea de a efectua o transmisie cu o probabilitate extrem de mică a erorilor prin utilizarea codurilor redundante pentru a asigura protecția împotriva perturbațiilor":"peu importe le niveau de perturbation présent dans un canal de communication, théoriquement, il existe la possibilité d'effectuer une transmission avec une probabilité extrêmement faible d'erreurs en utilisant des codes redondants pour assurer une protection contre les perturbations.",
    "În practică se utilizează strategia de adăugare intenționată de redundanță înainte de transmiterea informației.":"En pratique, la stratégie d'ajout intentionnel de redondance avant la transmission de l'information est utilisée.",
    " Această metodă implică utilizarea cuvintelor de cod cu lungimi n, printre care se numără și ":"Cette méthode implique l'utilisation de mots de code de longueurs n, parmi lesquels on compte notamment ",
    "Codul Hamming ciclic corector de o eroare, notat cu C(n,m)":"Code de Hamming cyclique correcteur d'une erreur, noté C(n, m)",
    " pe care îl vom aborda. Acest cod este utilizat în realitate, spre exemplu, în comunicații prin satelit deoarece semnalele pot fi susceptibile la erori datorate interferențelor și zgomotului în mediul de transmisie sau în memorii ECC (Error correction code) care stau la baza sistemelor de stocare RAID 2(Redundant Array of Independent Disks) capabile să recupereze datele în cazul unei defectări a unui disc și poate corecta corupția datelor doar atunci când datele și paritatea corespunzătoare sunt intacte.":" que nous aborderons. Ce code est utilisé dans la réalité, par exemple, dans les communications par satellite car les signaux peuvent être sujets à des erreurs dues aux interférences et au bruit dans le milieu de transmission, ou dans les mémoires ECC (Error Correction Code) qui sont à la base des systèmes de stockage RAID 2 (Redundant Array of Independent Disks) capables de récupérer les données en cas de défaillance d'un disque et de corriger la corruption des données uniquement lorsque les données et la parité correspondante sont intactes.",
    "Curs":"Cours",
    "Rădăcinile educației sunt amare, dar fructul este dulce.":"Les racines de l'éducation sont amères, mais le fruit est doux.",
    "Începe":"Commencez",
    "Aplicație":"Application en laboratoire",
    "Exemplul este cel mai bun percept.":"L'exemple est le meilleur précepte.",
    "Fă o pasiune din a învăța. Astfel, niciodată nu te vei opri din a crește.":"Fais de l'apprentissage une passion. Ainsi, tu ne cesseras jamais de grandir.",
    "Testează-ți cunoștințele":"Testez vos connaissances",
    "Scrie-ți propriile notițe pentru un proces de învățare mai organizat": "Écrivez vos propres notes pour un processus d'apprentissage plus organisé",
    "Delete":"Supprimez",
    "Save":"Enregistrez",
    "O sursă discretă fără memorie este caracterizată prin:":"Une source discrète sans mémoire est caractérisée par :",
    "Rezultatul tău:": "Votre résultat :",
    "START NEW QUIZ": "DÉMARREZ UN NOUVEAU QUIZ",
    "Soluție":"Solution",
    "BACK":"RETOUR",
    "Felicitări":"Félicitations",
    "ai ajuns la finalul laboratorului!":"tu as atteint la fin du laboratoire !",
    "Autori":"Auteurs",
    "Aspecte Teoretice":"Aspects Théoriques",
    "Începe simularea":"Commencez la simulation",
    "A început transmisia":"La transmission a commencé",
    "S-a terminat":"C'est fini",
    "transmisia":"la transmission",
    "Introdu biții de informație":"Entrez les bits d'information",
    "NEXT":"SUIVANT",
    "Introdu poziția bitului din intervalul [0,6] care a fost eronat pe timpul transmisiei ":"Entrez la position du bit dans l'intervalle [0,6] qui a été erroné pendant la transmission",
    "Începe decodarea":"Démarrez le décodage",
    "START":"COMMENCEZ",
    "Rod a 20 de ani de activitate didactică și științifică, lucrarea constituie prima parte a cursului de Teoria Transmiterii Informației ținut la Universitatea Tehnică din Cluj Napoca și cuprinde principiile de bază ale teorie informației și codării.":"Produit de 20 ans d'activité didactique et scientifique, le travail constitue la première partie du cours de Théorie de la Transmission de l'Information enseigné à l'Université technique de Cluj-Napoca, couvrant les principes de base de la théorie de l'information et du codage.",
    "Pentru o înțelegere mai profundă a conceptelor enunțate în cadrul aplicației, se sugerează lecturarea cărții:":"Pour une compréhension plus approfondie des concepts énoncés dans l'application, il est suggéré de lire le livre :",
    "Aplicația în sine nu reprezintă decât o ilustrare sumară a implementării Codului Hamming ciclic corector de o eroare în scopul de a fi cât mai accesibilă studentului. Acesta din urmă poate naviga către trei secțiuni :": "L'application elle-même n'est qu'une illustration sommaire de la mise en œuvre du code Hamming cyclique correcteur d'erreur dans le but d'être aussi accessible que possible pour l'étudiant. Ce dernier peut naviguer vers trois sections :",
    "pentru a dobândi cunoștintele fundamentale referitoare la codul vizat,":"pour acquérir les connaissances fondamentales concernant le code visé,",
    "Lucrare de laborator":"Application en laboratoire",
    "în cadrul căreia utilizatorul poate simula atât procesul de codare, cât și decodarea prin regiștrii de deplasare cu reacție cu sumatoare modulo-2 exterioare. A treia secțiune denumită":"dans laquelle l'utilisateur peut simuler à la fois le processus de codage et de décodage à l'aide de registres à décalage avec rétroaction et de sommateurs modulo-2 externes.",
    "Teste":"Tests",
    "oferă studentului ocazia de a-și evalua noțiunile asimilate.":"offre à l'étudiant l'occasion d'évaluer les notions assimilées.",
    "Această aplicație este destinată studenților din cadrul Academiei Forțelor Terestre Nicolae Bălcescu din Sibiu, de la programul de studii intitulat Inginerie și management în domeniul comunicațiilor militare pentru a fi utilizată atât ca suport teoretic, cât și practic la disciplina":"Cette application est destinée aux étudiants de l'Académie des Forces Terrestres Nicolae Bălcescu de Sibiu, du programme d'études intitulé Ingénierie et gestion des communications militaires, à utiliser à la fois comme support théorique et pratique dans le cadre du cours ",
    "curs susținut":" cours enseigné",
    "de către prof. univ. dr. ing. Monica Borda Elena":"par le professeur d'université, docteur ingénieur Monica Borda Elena",
    "a cărei dăruire didactică a contribuit la realizarea acestui instrument educativ.":"dont le dévouement pédagogique a contribué à la réalisation de cet outil éducatif.",
    "Prof. univ. dr. ing.":"professeur d'université, docteur ingénieur",
    "Codul Hamming ciclic corector de o eroare: algoritmul de codare și decodare ciclică prin RDR cu sumatoare modulo 2 exterioare":"Code Hamming cyclique correcteur d'une erreur : algorithme de codage et décodage cyclique par registres à décalage avec rétroaction avec des additionneurs modulo 2 externes",
    "Codurile ciclice corectoare de o eroare, de lungime n sunt de fapt coduri Hamming ciclice corectoare de o eroare cu structură sistematică. Acestea pot fi comparate cu codul BCH, corector de o singură eroare (t = 1), de lungime n = 2":"Les codes cycliques correcteurs d'erreur, de longueur n, sont en fait des codes cycliques de Hamming correcteurs d'erreur avec une structure systématique. Ils peuvent être comparés au code BCH, correcteur d'une seule erreur (t = 1), de longueur n = 2",
    "al cărui polinom generator g(x) este chiar polinomul primitiv de gradul k care generează pe GF(2":"dont le polynôme générateur g(x) est précisément le polynôme primitif de degré k qui génère sur GF(2)",
    "Cuprins":"Table des matières",
    "Codare algebrică":"Codage algébrique",
    "Ce este un registru de deplasare cu reacție (RDR) ?":"Qu'est-ce qu'un registre à décalage avec rétroaction  ?",
    "Algoritm de (de)codare ciclică utilizând RDR":"Algorithme de codage/décodage cyclique utilisant le registre à décalage avec rétroaction ",
    "Dimensionare:":"Dimensionnement du code",
    "Lungimea cuvantului de cod":"Longueur du mot de code",
    "biți de informație":"bits d'information",
    "biți de control":"bits redondants",
    "corectează o singură eroare":"corrige une seule erreur",
    "cuvânt de cod cu structură sistematică":"mot de code avec structure systématique",
    "Spre deosebire codurile Hamming bloc, ale căror cuvinte de cod aveau structură nesistematică, în cazul codurilor Hamming ciclice corectoare de o eroare, forma cuvântului de cod este una sistematică.": "Contrairement aux codes Hamming bloc, dont les mots de code avaient une structure non systématique, dans le cas des codes Hamming cycliques correcteurs d'erreur, la forme du mot de code est systématique.",
    "Coder cu RDR și":"Codeur par le registre à décalage avec rétroaction et ",
    "exterioare":"externes",
    "Ce se întâmplă pe durata primelor":"Que se passe-t-il pendant les premières",
    " perioade de tact?": " périodes d'horloge ?",
    "comutatorul K se află în poziția 1":"commutateur K en position 1",
    "biții de la intrare ajung la ieșire, astfel ca":"Les bits d'entrée atteignent la sortie, de sorte que",
    "biții de informație":"les bits d'information",
    "se vor afla pe cele mai semnificative poziții în cuvântul de cod v":"se trouveront sur les positions les plus significatives du mot de code v",
    "biții de la intrare se adună prin sumatorul":"les bits d'entrée s'additionnent par l'additionneur",
    "cu valorile din celulele registrului, formând în registru relații liniare": "avec les valeurs des cellules du registre, formant dans le registre des relations linéaires",
    "Ce se întâmplă pe durata următoarelor":"Que se passe-t-il pendant les",
    "perioade de tact?":"prochains cycles d'horloge?",
    "comutatorul K este în poziția 2, la intrare nu se vor mai afla biți":"L'interrupteur K est en position 2; à l'entrée, il n'y aura plus de bits",
    "se adună relațiile liniare existente în celulele registrului, obținându-se astfel la ieșire ":"Les relations linéaires existantes dans les cellules du registre à décalage sont additionnées, résultant en une sortie",
    "biții de control":"bits de contrôle",
    "în celula":"dans la cellule",
    "se obține 0 datorită sumatorului S":"On obtient 0 grâce à la somme de S",
    "care adună ieșirea sumatorului":"qui ajoute la sortie de la somme",
    "de două ori":"deux fois",
    "Conexiunea dintre celule și sumatorul S1 se realizează atunci când valoarea coeficientului corespunzător din g(x) este 1":"La connexion entre les cellules et la somme S1 se fait lorsque la valeur du coefficient correspondant dans g(x) est 1",
    "este tot timpul conectată la sumatorul S1 deoarece coeficientul":"elle est toujours connectée à la somme S1 car le coefficient",
    "celula":"cellule",
    "Observație:":"Remarque:",

    "Decoder cu RDR și":"Décodeur par le registre à décalage avec rétroaction et et",
    "exterioare pentru detecția erorilor":"externes pour la détection des erreurs",
    "Cum funcționează decoderul ?":"Comment fonctionne le décodeur ?",
    "Starea inițială a registrului este":"L'état initial du registre est",
    "pe primele n perioade de tact secvența r se adună cu valorile selectate din registru, rezultatul se înscrie în celula":"pendant les premières n périodes d'horloge, la séquence r est additionnée aux valeurs sélectionnées dans le registre, le résultat est inscrit dans la cellule",
    "la":"à",
    "tactul":"cycle d'horloge",
    "se verifică":"vérifie",
    "starea registrului ":"l'état du registre ",
    "dacă este":"si elle est",
    "atunci":"alors",
    "r este o secvență corectă":"r est une séquence correcte",
    "și":"et",
    "nu avem erori":"nous n'avons pas d'erreurs",
    "sau":"ou",
    "erorile sunt nedetectabile":"les erreurs sont indétectables",
    "dacă la":"si à",
    "starea registrului":"l'état du registre",
    "este":"est",
    "diferită de 0 se poate face detecția erorii":"différente de 0, la détection de l'erreur peut être effectuée",
    "prin calcularea stărilor S":"en calculant les états S",
    "până când se obține starea fixă: S":"jusqu'à ce que l'état fixe soit obtenu : S",
    "Dacă există o eroare pe poziția i, starea fixă va fi la tactul n+(n-i-1)":"S'il y a une erreur à la position i, l'état fixe sera au cycle d'horloge n+(n-i-1)",
    "Observație":"Remarque",
    "Sindromul S care se regăsește în starea RDR la momentul t=n":"Le syndrome S qui se trouve dans l'état du registre au moment t=n",
    "nu este egal cu restul (r(x))/(g(x)), ci o modificare a formei acestuia, dar care permite însă detecția erorii.":"n'est pas égal au reste (r(x))/(g(x)), mais une modification de sa forme, permettant cependant la détection de l'erreur.",
    "exterioare pentru corecția erorilor":"composants externes pour la correction des erreurs",
    "Cum se corectează erorile identificate la pasul anterior?":"Comment les erreurs identifiées à l'étape précédente sont-elles corrigées ?",
    "odată ce întregul cuvânt este recepționat (după cele n tacte), eroarea poate deveni detectabilă după cum am observat la pasul anterior":"une fois que le mot entier est reçu (après les n cycles d'horloge), l'erreur peut devenir détectable comme observé à l'étape précédente",
    "dacă":"si",
    "diferită de 0(practic încercăm prin această metodă matematică să localizăm eroarea din secvența recepționată) ":"différente de 0 (pratiquement, nous essayons par cette méthode mathématique de localiser l'erreur dans la séquence reçue) ",
    "deci se trece la calcularea stărilor":"nous passons donc au calcul des états",
    "până când se obține starea fixă:":"jusqu'à ce que l'état fixe soit atteint :",
    "dacă există o eroare pe poziția i, starea fixă va fi la tactul n+(n-i-1)":"s'il y a une erreur à la position i, l'état fixe sera au cycle d'horloge n+(n-i-1)",
    "în cazul codurilor ciclice, corecția se realizează pe durata (n+1, 2n), adunând valoarea „1” pe poziția ce conține eroarea":"dans le cas des codes cycliques, la correction est effectuée pendant (n+1, 2n), en ajoutant la valeur '1' à la position contenant l'erreur",
    "deci pentru corecția erorilor cu coduri ciclice sunt necesare 2n tacte.":"donc pour la correction des erreurs avec des codes cycliques, 2n cycles d'horloge sont nécessaires.",
    "starea fixă a RS este [ 1 0 … 0 ]":"l'état fixe du registre est [ 1 0 … 0 ]",
    "adică toate celulele vor fi nule, mai puțin":"ce qui signifie que toutes les cellules seront à zéro, sauf",
    "Dacă starea fixă va fi pe tactul 2n, atunci am avut stare fixă și pe tactul n.":"Si l'état fixe est au cycle d'horloge 2n, alors nous avions un état fixe au cycle d'horloge n.",
    "De remarcat faptul că daca starea ( 1 0 0 ....0 ) s-ar obține pe durata (1, n ), aceasta ar genera corecții false, de unde necesitatea ca funcționarea ": "Il est à noter que si l'état ( 1 0 0 ....0 ) est obtenu pendant (1, n ), cela générerait des corrections fausses, d'où la nécessité que le fonctionnement ",
    "să fie întreruptă":"soit interrompu",
    "Ce este un registru de deplasare cu reacție(RDR)?":"Qu'est-ce qu'un registre à décalage à rétroaction  ?",
    "Un registru de deplasare reprezintă un circuit secvențial liniar, alcătuit dintr-un ansamblu de bistabile(flip-flop-uri) utilizate pentru a stoca mai mulți biți de date și pentru a transfera informația de la o celulă de memorie la alta atunci când un semnal de ceas este aplicat în interiorul sau în exteriorul sistemului.":"Un registre à décalage est un circuit séquentiel linéaire, composé d'un ensemble de bascules (flip-flop) utilisées pour stocker plusieurs bits de données et pour transférer des informations d'une cellule de mémoire à une autre lorsqu'un signal d'horloge est appliqué à l'intérieur ou à l'extérieur du système.",
    "Pentru a forma un registru de deplasare cu N biți, este necesar să conectăm N flip-flop-uri.":"Pour former un registre à décalage avec N bits, il est nécessaire de connecter N bascules.",
    "Exemplul":"Exemple",
    "Cum funcționează un RDR?":"Comment fonctionne un tel registre (LFSR) ?",
    "Un singur bistabil, cel mai semniﬁcativ, primește la intrare o funcție logică XOR care este definită pe baza unor biți mai puțini semniﬁcativi":"Une bascule unique, la plus significative, reçoit en entrée une fonction logique XOR définie sur la base de bits moins significatifs.",
    "Determinarea biților care intră în calculul valorii viitoare a bitului cel mai semniﬁcativ depinde de polinomul generator g(x).":"La détermination des bits qui entrent dans le calcul de la valeur future du bit le plus significatif dépend du polynôme générateur g(x).",
    "Polinomul are gradul egal cu numărul de biți care alcătuiesc RDR¸ și prezintă indecșii biților care participă la determinare valorii viitoare a celui mai semniﬁcativ bit":"Le polynôme a un degré égal au nombre de bits composant le LFSR, et présente les indices des bits participant à la détermination de la valeur future du bit le plus significatif.",
    "Funcția XOR realizează operația de adunare aritmetică a biților.Pentru N bistabile se obține o":"La fonction XOR effectue l'opération d'addition arithmétique des bits. Pour N bascules, on obtient une",
    "secvență de numărarea de lungime maximă 2":"séquence de comptage de longueur maximale 2",
    "stare în care RDR conține doar valori nule este starea de blocare, prin urmare, se exclude":"un état dans lequel le LFSR ne contient que des valeurs nulles est l'état de verrouillage, il est donc exclu",
    "Un registru de deplasare cu reacție funcționează independent, doar pe baza semnalului de reacție.":"Un registre à décalage à rétroaction fonctionne de manière indépendante, uniquement sur la base du signal de rétroaction.",
    "Conexiunile de la nivelul registrului corespund polinomului generator g(x):":"Les connexions au niveau du registre correspondent au polynôme générateur g(x) :",
    "întotdeauna":"toujours",
    "Exemplul 3":"Exemple 3",
    "Unde regăsim regiștrii de deplasare cu reacție în domeniul tehnic?":"Où trouvons-nous les registres à décalage à rétroaction dans le domaine technique ?",
    "în secțiunea în care s-au prezentat codarea si decodarea algebrică s-a observat faptul că ambele procese se realizează prin divizare (împărțirea lui":"dans la section où la codification et la décodification algébriques ont été présentées, on a observé que les deux processus sont réalisés par division (la division de",
    "o implementarea mai facilă și rapidă a divizării se obține prin utilizarea unor":"une mise en œuvre plus facile et rapide de la division est obtenue en utilisant",
    "utilizând registru de deplasare cu reacție (RDR) cu sumatoare modulo 2 exterioare sau interioare.":"en utilisant un registre à décalage à rétroaction  avec des additionneurs modulo 2 externes ou internes.",
    "ajută la implementarea":"aide à mettre en œuvre",
    "algoritmului de transformări în domeniul Fourier rapid (FFT)":"l'algorithme de transformation rapide de Fourier (FFT)",
    "pentru procesarea semnalelor;":"pour le traitement des signaux;",
    "pot genera secvențe de numere pseudo-aleatoare, care pot fi utile în aplicații cum ar fi simulările, criptografia sau generarea de parole;":"peuvent générer des séquences de nombres pseudo-aléatoires, qui peuvent être utiles dans des applications telles que les simulations, la cryptographie ou la génération de mots de passe;",
    "în criptografie contribuie la generarea de chei secrete.":"en cryptographie, il contribue à la génération de clés secrètes.",
    "În criptografie se preferă polinoame primitive dense (majoritatea coeficienților au valori nenule), iar în codare sunt folosite cele rare (majoritatea coeficienților au valori zero).":"En cryptographie, on préfère les polynômes primitifs denses (la plupart des coefficients sont non nuls), tandis qu'en codage, on utilise ceux qui sont rares (la plupart des coefficients sont nuls).",
    "Este cunoscut faptul că spre deosebire de codurile bloc,":"Il est connu que contrairement aux codes blocs,",
    "codurile ciclice se reprezintă":"les codes cycliques sont représentés",
    "din punct de vedere matematic":"du point de vue mathématique",
    "sub formă polinomială":"sous forme polynomiale",
    "Pentru o secvență care conține n simboluri polinomul corespunzător atașat cuvântului de cod":"Pour une séquence contenant n symboles, le polynôme correspondant attaché au mot de code",
    "va fi de gradul n-1 sau mai mic":"aura un degré de n-1 ou moins",
    "Coeficienții polinomului sunt elementele":"Les coefficients du polynôme sont les éléments",
    "ale căror valori sunt":"dont les valeurs sont",
    "Pentru o secvență care conține":"Pour une séquence contenant",
    "m simboluri de informație polinomul informațional i(x) de gradul m-1":"m symboles d'information, le polynôme d'information i(x) de degré m-1",
    "este reprezentat astfel":"est représenté ainsi",
    "Polinomul generator al codului":"Le polynôme générateur du code",
    "se notează cu":"est noté par",
    "și trebuie să împlinească simultan două condiții":"et doit simultanément satisfaire deux conditions :",
    "1. să fie primitiv ( are ca divizori pe 1 și pe el însuși)":"1. il doit être primitif (ayant comme diviseurs 1 et lui-même)",
    "2. este de ordin k = n - m":"2. il doit être d'ordre k = n - m",
    "Relația":"La relation",
    "indică faptul că":"indique que",
    "este un":"c'est un",
    "multiplu":"multiple",
    "de-al":"de",
    "click pe buton pentru a vedea exemplu":"cliquez sur le bouton pour voir un exemple",
    "Exemplul 1":"Exemple 1",
    "Metoda de codare algebrică":"La méthode de codage algébrique",
    "implică utilizarea următoarei relații de codare:":"implique l'utilisation de la relation de codage suivante :",
    "restul":"le reste",
    "La decodare":"Lors du décodage",
    "se va calcula":"on calcule",
    "sindromul erorii":"le syndrome d'erreur",
    "pentru a verifica dacă":"pour vérifier si",
    "secvența recepționată este corectă sau dacă a fost afectată de erori în timpul transmisiei":"la séquence reçue est correcte ou si elle a été affectée par des erreurs pendant la transmission",
    "Dacă se presupune că erorile sunt de tip aditiv, atunci secvența recepționată se definește prin relația din care reiese faptul că sindromul depinde doar de cuvântul eroare e(x):":"Si l'on suppose que les erreurs sont de type additif, alors la séquence reçue est définie par la relation d'où il apparaît que le syndrome dépend uniquement du mot d'erreur e(x) :",
    "Se verifică legea de codare prin împărțirea r(x)/g(x), iar rezultatul obținut reprezintă sindromul erorii s(x).": "La loi de codage est vérifiée en divisant r(x)/g(x), et le résultat obtenu représente le syndrome d'erreur s(x).",
    "dacă s(x) = 0, atunci r(x) = v(x), adică nu sunt erori sau acestea sunt nedetectabile;": "si s(x) = 0, alors r(x) = v(x), c'est-à-dire qu'il n'y a pas d'erreurs ou qu'elles sont indétectables ;",
    "dacă s(x) ≠ 0, se face detecția erorii.":"si s(x) ≠ 0, la détection des erreurs est effectuée.",
    " Sindromul s(x) este un polinom de grad mai mic sau egal cu k-1, deci în cazul codurilor binare exista 2":" Le syndrome s(x) est un polynôme de degré inférieur ou égal à k-1, donc dans le cas des codes binaires, il existe 2",
    "combinații distincte, de unde rezultă că din cele 2":"combinaisons distinctes, d'où il résulte que parmi les 2",
    "combinații posibile de erori, vor putea fi corectate":"combinaisons possibles d'erreurs, certaines pourront être corrigées",
    "maxim":"au maximum",
    "combinația nulă este folosită pentru ilustrarea neeronării":"la combinaison nulle est utilisée pour illustrer l'absence d'erreurs",
    "Antrenează-te mai mult": "Entraîne-toi davantage",
    "Ești pe drumul cel bun! Antrenează-te în continuare !": "Tu es sur la bonne voie ! Continue de t'entraîner !",
    "Felicitări! Ai răspuns corect la toate întrebările!": "Félicitations ! Tu as répondu correctement à toutes les questions !",
    "Enter name:": "Entrez votre nom :",
    "Richard Wesley Hamming was an American mathematician and computer scientist.":"Richard Wesley Hamming a été un mathématicien et informaticien américain.",
    "One of his most well-known contributions is the development of Hamming codes, a class of error-correcting codes used in digital communication to detect and correct errors in transmitted data.":"Une de ses contributions les plus connues est le développement des codes Hamming, une classe de codes correcteurs d'erreurs utilisée dans la communication numérique pour détecter et corriger les erreurs dans les données transmises.",
    "Introducere":"Introduction",
    "Decoder pentru corectia erorilor":"Décodeur pour la correction d'erreurs",
    "Decoder pentru detectia erorilor":"Décodeur pour la détection d'erreurs",
    "Simuleaza codare si decodarea":"Simuler l'encodage et le décodage",
    "CODARE ȘI DECODARE CICLICĂ PRIN REGIȘTRII DE DEPLASARE CU REACȚIE":"Codage et décodage cyclique par registres à rétroaction"

    












        
                






    }

        
